package homework;

public class HomeWork1 {

	public static void main(String[] args) {
		//第一題：請設計一隻Java程式，計算12，6這兩個數值的和與積
		
//
//		int a = 12 , b = 6;
//		System.out.println("a+b = "+18+ "，"+ "a×b = "+72);
//		
		
		/*********************************************************************************************************/	
		//第二題：請設計一隻Java程式，計算200顆蛋共是幾打幾顆？ (一打為12顆)
		
//		int a = 200 , b = 12, dozen , remainder;
//		dozen = a/b ;
//		remainder = a%b;
//		System.out.println("200顆蛋一共是 " + dozen +" 打，且剩下 "+remainder+" 顆");

		/*********************************************************************************************************/	
	
		//第三題：請由程式算出256559秒為多少天、多少小時、多少分與多少秒
		
		//方法一
		
//		double a = 256559 , day , hour , min , sec;
//        day = (a-a % (24*Math.pow(60,2)))/(24*Math.pow(60,2)); 
//        hour = (a%(24*Math.pow(60,2))-a % (Math.pow(60,2)))/ (Math.pow(60,2));
//        min =( a % (Math.pow(60,2))-a %60)/60;
//        sec = a%60;
//        System.out.println("256559秒為 " + day+" 天" +  hour + " 時" + min +" 分"+sec+" 秒");
		
		//方法二
		
//		int a = 256559 , day , hour , min , sec ;
//		day = (a - a%(24*60*60))/(24*60*60);
//		hour = (a%(24*60*60)-a%(60*60))/(60*60);
//		min = (a % (60*60)-a%60)/60;
//		 sec = a%60;
//		 System.out.println("256559秒為 " + day+" 天" +  hour + " 時" + min +" 分"+sec+" 秒");
		
		/*********************************************************************************************************/			
		
		//第四題：請定義一個常數為3.1415(圓周率)，並計算半徑為5的圓面積與圓周長
		
//		final double PI = 3.1415;
//		int radius = 5;
//		double roundarea, perimeter ;
//		roundarea =radius*radius*PI;
//		perimeter =radius*2*PI;
//		System.out.println("半徑為5的圓面積為 "+roundarea+ " 其圓周長為 " +perimeter);
		
		/*********************************************************************************************************/			
		
		/*第五題：某人在銀行存入150萬，銀行利率為2%，如果每年利息都繼續存入銀行，
		   請用程式計算10年後，本金加利息共有多少錢*/
		
//		int a = 150 ;   double rate ;
//		rate = Math.pow(1.02,10);
//		System.out.println("本金150萬，利率2%，十年後本利和為 " + (a*rate)+" 萬");
		
		/*********************************************************************************************************/			
		
		/*第六題：請寫一隻程式，利用System.out.println()印出以下三個運算式結果
		 * 5 + 5
		 *  5 + „5‟
		 *  5 + “5”
		 *並請用註解各別說明答案的產生原因 */
		
//		System.out.println(5+5);                                   //此處加號為數字相加
//		System.out.println(5+'5'); 								//由於char可被轉型成int的形式，故此處'5'被Java轉成相對應的unicode碼運算		
//		System.out.println(5+"5");								/*此處被視作數字+字串的結合*/
		
	}

}
